Revit 2027 API
BuiltInFailures.PartMakerMethodForWallFailures.CouldNotAdjustWallPartsAtJoin Property
 Failed to extend or trim some layer at an end join
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouldNotAdjustWallPartsAtJoin { get; }
Public Shared ReadOnly Property CouldNotAdjustWallPartsAtJoin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouldNotAdjustWallPartsAtJoin {
	FailureDefinitionId^ get ();
}
static member CouldNotAdjustWallPartsAtJoin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PartMakerMethodForWallFailures Class
Autodesk.Revit.DB Namespace